app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
  	@product = Product.find_by_id(params[:id])
  	@comments = Comment.where(:product_id => @product.id)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("product_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["body", "123"], ["created_at", 2017-05-24 12:09:33 UTC], ["updated_at", 2017-05-24 12:09:33 UTC]]
---
  def create
  	@product = Product.find(params[:product_id])
  	 pp @product
  	@comment = @product.comments.create(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
  def destroy
    @comment = Comment.find_by_id(params[:id])

        @comment.destroy