app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "product_id", "cost", "created_at", "updated_at", "is_cart") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["product_id", 1], ["cost", 20.0], ["created_at", 2017-05-26 12:50:19 UTC], ["updated_at", 2017-05-26 12:50:19 UTC], ["is_cart", true]]
---
  def new
  	@book = Book.find_by_id(params[:id])
  	@order = Order.new(:book_id => @book.id,:user_id => current_user.id, :cost => @book.cost, :is_cart => true)
  	@order.save

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."is_cart" = ?  [["user_id", 1], ["is_cart", true]]
SELECT "orders"."id" FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index
  	@orders = Order.where(user_id: current_user.id).where(is_cart: true)
    @user = User.where(user_id: current_user.id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "is_cart" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["is_cart", false], ["updated_at", 2017-05-29 09:33:57 UTC], ["id", 3]]
---
  def pay
    @order = Order.find_by_id(params[:id])
    @order.update(:is_cart => false)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 2]]
---
  def delete
    @order = Order.find_by_id(params[:id])
    @order.destroy