app/controllers/userparams_controller.rb

  def create
  	@userparam = current_user.build_userparam(user_params)
  	if @userparam.save
---
INSERT INTO "userparams" ("firstname", "lastname", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "Arti"], ["lastname", "Scream"], ["city", "Uzhorod"], ["user_id", 1], ["created_at", 2017-05-05 12:19:38 UTC], ["updated_at", 2017-05-05 12:19:38 UTC]]
UPDATE "userparams" SET "user_id" = ?, "updated_at" = ? WHERE "userparams"."id" = ?  [["user_id", nil], ["updated_at", 2017-05-12 11:35:39 UTC], ["id", 1]]

  def edit
    @userparam = Userparam.find_by_user_id(current_user.id)
---
SELECT  "userparams".* FROM "userparams" WHERE "userparams"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def update
    @userparam = Userparam.find_by_user_id(current_user.id)
      if @userparam.update(user_params)
---
SELECT  "userparams".* FROM "userparams" WHERE "userparams"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
UPDATE "userparams" SET "city" = ?, "updated_at" = ? WHERE "userparams"."id" = ?  [["city", "Uzhorod2"], ["updated_at", 2017-05-12 11:46:56 UTC], ["id", 2]]